---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalPanel.GetAnalyticalOpeningsIds
source: html/848d940c-3664-0533-576f-7876b5c2bf1d.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalPanel.GetAnalyticalOpeningsIds Method

Returns the Analytical Openings ids of the Analytical Panel.

## Syntax (C#)
```csharp
public ISet<ElementId> GetAnalyticalOpeningsIds()
```

## Returns
Set of ElementId.